package com.cwlrdc.front.common;

import lombok.Getter;

public enum ResponseResult {
    // 系统级别
    操作成功("0"),
    系统错误("10001"),
    通讯中断("10002"),
    未开启("10003"),
    包数据持久化错误("10004"),
    包体摘要校验错误("20001"),
    期号错误("20002"),
    游戏编码错误("20003"),
    验签失败("20004"),
    实时票错误信息("20005"),
    数据包解析错误("20006"),
    无效或注销票错误("20007"),
    流水号错误("20008"),
    流水号重复("20009"),
    最大序列号重复错误("20010"),
    省市编码错误("20011"),
    数据来源错误("20012"),
    期结时间错误("20013"),
    中奖号码错误("20014"),
    省码错误("20015"),
    开奖公告记录不存在("20016");

    private ResponseResult(String id) {
        this.id = id;
    }

    private
    @Getter
    final String id;
}
